mstump/msp430_adc_soft_uart/src/soft_uart.c
/* --COPYRIGHT--,BSD_EX
 * Copyright (c) 2012, Texas Instruments Incorporated
 * Copyright (c) 2014, Matthew Stump
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 *******************************************************************************
 *
 *                       MSP430 CODE EXAMPLE DISCLAIMER
 *
 * MSP430 code examples are self-contained low-level programs that typically
 * demonstrate a single peripheral function or device feature in a highly
 * concise manner. For this the code may rely on the device's power-on default
 * register values and settings such as the clock configuration and care must
 * be taken when combining code from several examples to avoid potential side
 * effects. Also see www.ti.com/grace for a GUI- and www.ti.com/msp430ware
 * for an API functional library-approach to peripheral configuration.
 *
 * --/COPYRIGHT--*/


//******************************************************************************
//  MSP430G2xx1 Demo - Timer_A, Ultra-Low Pwr UART 9600 Echo, 32kHz ACLK
//
//  Description: Use Timer_A CCR0 hardware output modes and SCCI data latch
//  to implement UART function @ 9600 baud. Software does not directly read and
//  write to RX and TX pins, instead proper use of output modes and SCCI data
//  latch are demonstrated. Use of these hardware features eliminates ISR
//  latency effects as hardware insures that output and input bit latching and
//  timing are perfectly synchronised with Timer_A regardless of other
//  software activity. In the Mainloop the UART function readies the UART to
//  receive one character and waits in LPM3 with all activity interrupt driven.
//  After a character has been received, the UART receive function forces exit
//  from LPM3 in the Mainloop which configures the port pins (P1 & P2) based
//  on the value of the received byte (i.e., if BIT0 is set, turn on P1.0).

//  ACLK = TACLK = LFXT1 = 32768Hz, MCLK = SMCLK = default DCO
//  //* An external watch crystal is required on XIN XOUT for ACLK *//
//
//               MSP430G2xx1
//            -----------------
//        /|\|              XIN|-
//         | |                 | 32kHz
//         --|RST          XOUT|-
//           |                 |
//           |   CCI0B/TXD/P1.1|-------->
//           |                 | 9600 8N1
//           |   CCI0A/RXD/P1.2|<--------
//
//  D. Dang
//  Texas Instruments Inc.
//  October 2010
//  Built with CCS Version 4.2.0 and IAR Embedded Workbench Version: 5.10
//******************************************************************************

#include <msp430.h>
#include "soft_uart.h"

// Conditions for 9600 Baud SW UART, SMCLK = 1MHz
#define UART_TBIT_DIV_2 (1000000 / (9600 * 2))
#define UART_TBIT       (1000000 / 9600)


// Global variables used for full-duplex UART communication
unsigned int            gTxData;        // UART internal variable for TX
unsigned char           gRxBuffer;      // Received UART character
soft_uart_rx_callback_t gRxCallback;


/**
 * Function configures Timer_A for full-duplex UART operation
 *
 * @param optional receive callback, pass NULL if not used.
 */
void
soft_uart_init(
    soft_uart_rx_callback_t rxCallback) {
  gRxCallback = rxCallback;
  TACCTL0 = OUT;                          // Set TXD Idle as Mark = '1'
  TACCTL1 = SCS + CM1 + CAP + CCIE;       // Sync, Neg Edge, Capture, Int
  TACTL = TASSEL_2 + MC_2;                // SMCLK, start in continuous mode
}


/**
 * Outputs one byte using the Timer_A UART
 *
 * @param byte to be transmitted
 */
void
soft_uart_tx(
    unsigned char byte) {
  while (TACCTL0 & CCIE);               // Ensure last char got TX'd
  TACCR0    = TAR;                      // Current state of TA counter
  TACCR0   += UART_TBIT;                // One bit time till first bit
  TACCTL0   = OUTMOD0 + CCIE;           // Set TXD on EQU0, Int
  gTxData   = byte;                     // Load global variable
  gTxData  |= 0x100;                    // Add mark stop bit to TXData
  gTxData <<= 1;                        // Add space start bit
}


/**
 * Prints a string over using the Timer_A UART
 *
 * @param null terminated string to be transmitted
 */
void
soft_uart_print(
    char *input) {
  while (*input) {
    soft_uart_tx(*input++);
  }
}


/**
 * Synchronous fetch of byte from uart.
 *
 * @return received byte
 */
unsigned char
soft_uart_get() {
  __bis_SR_register(LPM0_bits);
  return gRxBuffer;
}


/**
 * Timer_A UART - Transmit Interrupt Handler
 *
 * @return void
 */
#pragma vector = TIMERA0_VECTOR
__interrupt void
Timer_A0_ISR() {
  static unsigned char txBitCnt = 10;

  TACCR0 += UART_TBIT;                    // Add Offset to CCRx
  if (txBitCnt == 0) {                    // All bits TXed?
    TACCTL0 &= ~CCIE;                   // All bits TXed, disable interrupt
    txBitCnt = 10;                      // Re-load bit counter
  } else {
    if (gTxData & 0x01) {
      TACCTL0 &= ~OUTMOD2;              // TX Mark '1'
    } else {
      TACCTL0 |= OUTMOD2;               // TX Space '0'
    }
    gTxData >>= 1;
    txBitCnt--;
  }
}

/**
 * Timer_A UART - Receive Interrupt Handler
 *
 * @return void
 */
#pragma vector = TIMERA1_VECTOR
__interrupt void
Timer_A1_ISR() {
  static unsigned char rxBitCnt = 8;
  static unsigned char rxData = 0;

  switch (TAIV) {                       // Use calculated branching
    case TAIV_TACCR1:                   // TACCR1 CCIFG - UART RX

      TACCR1 += UART_TBIT;              // Add Offset to CCRx
      if (TACCTL1 & CAP) {              // Capture mode is start bit edge
        TACCTL1 &= ~CAP;                // Switch capture to compare mode
        TACCR1  += UART_TBIT_DIV_2;     // Point CCRx to middle of D0
      } else {
        rxData >>= 1;
        if (TACCTL1 & SCCI) {           // Get bit waiting in receive latch
          rxData |= 0x80;
        }
        rxBitCnt--;

        if (rxBitCnt == 0) {            // All bits RXed?
          gRxBuffer  = rxData;          // Store in global variable
          rxBitCnt   = 8;               // Re-load bit counter
          TACCTL1   |= CAP;             // Switch compare to capture mode
          __bic_SR_register_on_exit(LPM0_bits); // Clear LPM0 bits from 0(SR)
          if (gRxCallback) {
            gRxCallback(gRxBuffer);
          }
        }
      }
      break;
  }
}
